Revit 2027 API
CategorySet.Contains Method
Tests for the existence of a category within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	Category item
)
Public Overridable Function Contains (
	item As Category
) As Boolean
public:
virtual bool Contains(
	Category^ item
)
abstract Contains :
        item : Category -> bool
override Contains :
        item : Category -> bool
Parameters
item Category
The category to be searched for.
Return Value
Boolean
The Contains method returns True if the category is within the set, otherwise False.
See Also
Reference
CategorySet Class
Autodesk.Revit.DB Namespace